Revit 2027 API
HostedSweep.VerticalOffset Property
Retrieve/set the vertical offset of the hosted sweep object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VerticalOffset { get; set; }
Public Property VerticalOffset As Double
	Get
	Set
public:
property double VerticalOffset {
	double get ();
	void set (double value);
}
member VerticalOffset : float with get, set
Property Value
Double
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace